kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_6_0/ESP32-S3-Station-V_7_6_0.ino
/**
 * ============================================================================
 * โครงการวิจัย: ผลของการใช้นวัตกรรม Smart IV Alert ต่อความแม่นยำในการแจ้งเตือนและปริมาณสารน้ำที่ได้รับ
 * หน่วยงาน: หอผู้ป่วยอายุรกรรม โรงพยาบาลสูงเม่น อำเภอสูงเม่น จังหวัดแพร่
 * สถาบัน: วิทยาลัยพยาบาลบรมราชชนนี แพร่ คณะพยาบาลศาสตร์ สถาบันพระบรมราชชนก
 *
 * ระบบ: Bed Station Node (เครื่องตรวจวัดและแจ้งเตือนประจำเตียง)
 * เวอร์ชัน: 7.6.0 (Protocol v3 — ใช้คู่กับ Central Host Firmware 4.6.0 / 4.7.0 / 4.9.x)
 * บอร์ดประมวลผล: ESP32-S3 Super Mini + จอสี TFT 1.47" (ST7789 SPI 172x320) + Passive Buzzer
 * เซ็นเซอร์หยด: โมดูลเอาต์พุตดิจิทัล (มีวงจรเปรียบเทียบในตัว) ให้พัลส์ Active HIGH ต่อ 1 หยด
 *
 * ---------------------------------------------------------------------------
 * เปลี่ยนใน V7.6.0: เปลี่ยนมาใช้เซ็นเซอร์หยดแบบเอาต์พุตดิจิทัล และจัดผังขาใหม่
 *  - เดิมอ่าน ADC ทุกรอบ loop แล้วเทียบกับ threshold ที่ได้จาก Calibration Wizard
 *    ตอนนี้ใช้ขัดจังหวะ (interrupt) ที่ขอบขาขึ้นของสัญญาณ DO แทน จึงไม่พลาดหยด
 *    แม้ขณะกำลังวาดจอหรือส่ง ESP-NOW และไม่ต้องคาลิเบรตในซอฟต์แวร์อีก
 *    (ความไวปรับที่ตัวโมดูลด้วยโวลุ่ม ดูผลได้จากหน้า SENSOR TEST)
 *  - ผังขาใหม่: DO = GPIO 5, Buzzer = GPIO 6, ปุ่ม = GPIO 7 (เดิม 4 / 3 / 2)
 *    เลิกใช้ GPIO 3 ซึ่งเป็น strapping pin และย้ายทั้งชุดมาอยู่ติดกับบล็อกจอ (8-13)
 *  - ตัด Calibration Wizard, ค่า TH/HYS และ NVS namespace "st_cal" ออกทั้งหมด
 *    กดปุ่มค้าง 3 วินาที = หน้า SENSOR TEST (ดูระดับสัญญาณ จำนวนพัลส์ ความกว้างพัลส์)
 *  - ตรวจตอนบูตว่าขา DO ไม่ได้ค้างอยู่ที่ระดับ HIGH (สายผิดหรือปรับโวลุ่มเลยจุด)
 *  - ตรรกะการคำนวณอัตราไหล การแจ้งเตือน และแพ็กเก็ต Protocol v3 เหมือน V7.5.0 ทุกประการ
 *
 * ---------------------------------------------------------------------------
 * เปลี่ยนใน V7.5.0: ออกแบบหน้าจอ TFT ใหม่ทั้งหมด (UX/UI สำหรับใช้งานจริงที่เตียง)
 *  - แนวคิด "IV BAG": หน้าหลักแสดงภาพถุงน้ำเกลือที่ระดับน้ำลดลงจริงตามปริมาณที่ให้ไปแล้ว
 *    พร้อมกระเปาะหยดที่มีภาพเคลื่อนไหวตามหยดจริง และตัวเลขสำคัญเพียง 4 ค่า
 *    (อัตราไหล / ปริมาณคงเหลือ / เวลาที่เหลือ / เวลาที่จะหมด)
 *  - ลดข้อความบนจอลงเหลือเท่าที่จำเป็น ใช้สีและตำแหน่งแทนคำอธิบาย
 *    แถบสถานะสีที่ขอบบนบอกภาวะของเตียงตั้งแต่แรกเห็น (เขียว/เหลือง/ส้ม/แดง/ฟ้า)
 *  - เพิ่มหน้าที่ 4: กราฟแท่งแนวโน้มอัตราไหลย้อนหลัง 30 นาที พร้อมเส้นอัตราเป้าหมาย
 *    ใช้ดูว่าการไหลสม่ำเสมอหรือมีช่วงที่ตกไป โดยไม่ต้องเปิดหน้าเว็บ
 *  - หน้า PLAN และ LINK จัดใหม่เป็นการ์ดตัวเลขใหญ่ อ่านได้จากปลายเตียง
 *  - จอเตือนวิกฤต/ใกล้หมดถุง/Screensaver ออกแบบใหม่ให้เหลือข้อความเท่าที่ต้องอ่าน
 *  - ตรรกะการวัด การสื่อสาร และการแจ้งเตือนทั้งหมดเหมือน V7.4.0 ทุกประการ
 *    (โครงสร้างแพ็กเก็ต Protocol v3 ไม่เปลี่ยน ใช้กับ Host เดิมได้ทันที)
 *
 * ---------------------------------------------------------------------------
 * เพิ่มใน V7.4.0: แจ้งเตือนใกล้หมด (เตรียมถุงใหม่)
 *  - เตือนเมื่อให้สารน้ำไปแล้วถึง % ที่ตั้งจากหน้าเว็บ (ค่าเริ่มต้น 80% ของปริมาตรตามแผน)
 *  - แสดงจอสีส้ม "PREPARE NEXT BAG" + เสียงเตือนเบา 3 ครั้ง ซ้ำทุก 5 นาทีจนกว่าจะกดรับทราบ
 *  - คลิกปุ่มที่เตียง หรือกดรับทราบที่ Host/หน้าเว็บ = รับทราบ (ซิงก์กันทั้งระบบ)
 *  - ไม่นับเป็นเหตุวิกฤต ไม่เข้าจอ EMERGENCY สีแดง
 *
 * สรุปการแก้ไขจาก V7.2.3
 *  1) โครงสร้างแพ็กเก็ต ESP-NOW ตรงกับ Host ทุกไบต์ (มี static_assert ตรวจขนาด)
 *     ส่งอัตราไหล + เวลาตั้งแต่หยดล่าสุด + แรงดันแบตเตอรี่ (ถ้ามีวงจร)
 *  2) รับ Drop factor จาก Host แทนค่าคงที่ 20 gtt/mL
 *  3) แก้แจ้งเตือนสายพับผิด: เดิมเข้า EMERGENCY ทันทีหลังหยดแรก และค้างเมื่อกดหยุดชั่วคราว
 *     -> ใช้เกณฑ์ "ไม่มีหยดนานเกิน 2.5 เท่าของช่วงหยดตามเป้าหมาย (ขั้นต่ำ 8 วินาที)" สูตรเดียวกับ Host
 *  4) รหัสเตือน เร็ว/ช้าเกิน/ครบแผน มาจาก Host (มีหน่วงยืนยัน 20 วินาที) — สายพับตัดสินในเครื่องทันที
 *  5) ค้นหาช่องสัญญาณของ Host อัตโนมัติ (Channel 1-13) เมื่อขาดการเชื่อมต่อ และจำช่องล่าสุด
 *  6) ลดการวาดจอ TFT ทุกรอบ loop -> วาดเฉพาะเมื่อสถานะเปลี่ยน ไม่แย่งเวลาตรวจจับหยด
 *  7) รองรับคำสั่ง "เริ่มถุงใหม่" จากหน้าเว็บ (รีเซ็ตตัวนับ)
 *  8) ในจอ EMERGENCY: คลิก 1 ครั้ง = พักเสียง 2 นาที, ดับเบิลคลิก = หยุด/เริ่มนับ
 *  9) Screensaver ทำงานจริงเมื่อไม่มีการกดปุ่ม 3 นาที (คลิกเพื่อปลุก)
 * 10) ไฟ RGB แสดงสถานะ: แดง=เตือน, เหลือง=หยุดชั่วคราว, น้ำเงิน=ไม่พบ Host, เขียว=ปกติ
 *
 * การใช้ปุ่ม (ปุ่มเดียว)
 *  - คลิก 1 ครั้ง      : เปลี่ยนหน้า 1/2/3/4  (ในจอเตือน = พักเสียง 2 นาที)
 *  - ดับเบิลคลิก       : หยุด/เริ่มนับหยด (PAUSE)
 *  - คลิก 3 ครั้ง      : ตั้งหมายเลขเตียง 1-8
 *  - กดค้าง 3 วินาที   : หน้าทดสอบเซ็นเซอร์ (SENSOR TEST)
 *  - กดค้าง 5 วินาที   : หน้าผู้พัฒนา
 * ============================================================================
 */

#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <Preferences.h>
#include <Adafruit_GFX.h>
#include <Adafruit_ST7789.h>
#include <SPI.h>
#include <time.h>
#include <sys/time.h>

#define APP_VERSION         "7.6.0"

#define TFT_CS              9
#define TFT_DC              10
#define TFT_RST             11
#define TFT_MOSI            12
#define TFT_SCLK            13
#define TFT_BLK             8

// ---- เซ็นเซอร์หยดแบบเอาต์พุตดิจิทัล + ปุ่ม + บัซเซอร์ (จัดกลุ่มไว้ติดกับบล็อกจอ 8-13) ----
#define DROP_DO_PIN         5     // ขา DO ของโมดูลเซ็นเซอร์ (พัลส์ 1 ครั้ง = 1 หยด)
#define BUZZER_PIN          6
#define BTN_PIN             7
#define RGB_LED_PIN         48

// ทิศทางสัญญาณของโมดูล: 1 = ปกติ LOW มีหยดแล้วขึ้นเป็น HIGH (Active HIGH)
//                        0 = ปกติ HIGH มีหยดแล้วตกลงเป็น LOW (Active LOW เช่นโมดูล LM393 ส่วนใหญ่)
// เปลี่ยนค่านี้ค่าเดียว โค้ดจะสลับทั้งโหมด pull ภายในและขอบสัญญาณที่ใช้ตรวจจับให้เอง
#define DROP_ACTIVE_HIGH    1

// เวลากันสัญญาณรัว: พัลส์ที่มาเร็วกว่านี้ถือว่าเป็นการสั่นของวงจรเปรียบเทียบ ไม่ใช่หยดใหม่
// 30 ms = รองรับได้ถึงราว 2000 หยด/นาที ซึ่งสูงกว่าการให้สารน้ำจริงมาก
#define DROP_DEBOUNCE_MS    30

// วงจรวัดแบตเตอรี่ (ถ้ามี): ใส่หมายเลขขา ADC ที่ต่อผ่านตัวต้านทานแบ่งแรงดัน 1:1
// GPIO 4 ว่างแล้วหลังย้ายเซ็นเซอร์ จึงใช้เป็นขาวัดแบตเตอรี่ได้
// -1 = ไม่มีวงจร -> ส่งค่า 0 และหน้าเว็บ/Host แสดง "N/A"
#define STATION_BAT_ADC_PIN -1
#define BAT_DIVIDER_RATIO   2.0f

// ----------------------------------------------------------------------------
// ค่าคงที่ของระบบสื่อสารและการแจ้งเตือน (ต้องตรงกับ Host)
// ----------------------------------------------------------------------------
#define DEFAULT_ESPNOW_CHANNEL  1
#define MAX_WIFI_CHANNEL        13
#define HOST_TIMEOUT_MS         5000
#define CHANNEL_SCAN_DWELL_MS   2500     // Host ส่ง Sync ทุก 1 วินาที -> รอแต่ละช่อง 2.5 วินาที
#define CHANNEL_SCAN_START_MS   6000     // หลังบูตรอช่องที่จำไว้ก่อน 6 วินาที
#define SEND_INTERVAL_MS        1000
#define MIN_OCCLUSION_MS        8000
#define MAX_OCCLUSION_MS        300000
#define SCREENSAVER_IDLE_MS     180000
#define SNOOZE_MS               120000
#define NEAR_END_REMIND_MS      300000   // เตือนใกล้หมดซ้ำทุก 5 นาทีจนกว่าจะรับทราบ
#define DEFAULT_NEAR_END_PCT    80

#define ALERT_NONE        0
#define ALERT_TOO_FAST    1
#define ALERT_TOO_SLOW    2
#define ALERT_NEAR_END    3   // ให้ไปแล้วถึง % ที่ตั้ง (เตรียมถุงใหม่)
#define ALERT_COMPLETE    4
#define ALERT_OCCLUSION   5

#define THEME_BG            0x0000
#define THEME_SKYBLUE       0x5DFF
#define THEME_CYAN          0x07FF
#define THEME_PINK          0xFD79
#define THEME_NAVY          0x09CD
#define THEME_DARKBOX       0x18C5
#define THEME_MAROON        0x6000

#define COLOR_WHITE         0xFFFF
#define COLOR_GREEN         0x07E0
#define COLOR_RED           0xF800
#define COLOR_ORANGE        0xFD20
#define COLOR_YELLOW        0xFFE0

// ชุดสีของหน้าจอรุ่นใหม่ (พื้นดำ การ์ดเทาเข้ม ตัวอักษรรองสีเทา)
#define UI_CARD             0x18C5   // พื้นการ์ด
#define UI_BAR              0x0A49   // แถบบนสุด
#define UI_LINE             0x39E7   // เส้นคั่น/แถบว่าง
#define UI_DIM              0x8410   // ข้อความรอง
#define UI_GREEN            0x2FEB   // เขียวอ่านง่ายบนพื้นดำ

