kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_6_0/ESP32-S3-Station-V_7_6_0.ino
// ---- ประกาศล่วงหน้า (ฟังก์ชันที่ถูกเรียกก่อนบรรทัดที่นิยามไว้) ----
void beepNonBlocking(uint16_t freq, uint16_t durationMs);
void resetTrendData();
void updateTrendAccumulator(unsigned long now);

// ----------------------------------------------------------------------------
// ฟังก์ชันช่วย
// ----------------------------------------------------------------------------
// อ่านว่าขณะนี้สาย DO อยู่ที่ระดับ "มีหยดผ่าน" หรือไม่ (ใช้ทั้งหน้าจอและตอนตรวจสายตอนบูต)
inline bool dropLineActive() {
#if DROP_ACTIVE_HIGH
  return digitalRead(DROP_DO_PIN) == HIGH;
#else
  return digitalRead(DROP_DO_PIN) == LOW;
#endif
}

void clearDropQueue();

uint8_t safeDropFactor(uint8_t df) {
  return (df == 10 || df == 15 || df == 20 || df == 60) ? df : 20;
}

bool isCriticalAlert(uint8_t code) {
  return code == ALERT_TOO_FAST || code == ALERT_TOO_SLOW ||
         code == ALERT_COMPLETE || code == ALERT_OCCLUSION;
}

// สูตรเดียวกับ Host
uint32_t occlusionThresholdMs() {
  float rate = targetRateHr;
  if (rate <= 0.0f) return MIN_OCCLUSION_MS;
  float dropsPerHr = rate * (float)safeDropFactor(dropFactor);
  uint32_t expected = (uint32_t)(3600000.0f / dropsPerHr);
  uint32_t th = (expected * 5) / 2;
  if (th < MIN_OCCLUSION_MS) th = MIN_OCCLUSION_MS;
  if (th > MAX_OCCLUSION_MS) th = MAX_OCCLUSION_MS;
  return th;
}

bool isLocallyOccluded() {
  return isRunning && hasFirstDropOccurred && (millis() - lastDropTimestamp > occlusionThresholdMs());
}

uint8_t safeNearPct(uint8_t p) {
  return (p >= 50 && p <= 95) ? p : DEFAULT_NEAR_END_PCT;
}

bool isNearEndReached() {
  if (totalPlanMl <= 0) return false;
  return totalVolumeMl >= totalPlanMl * (float)safeNearPct(nearEndPct) / 100.0f;
}

bool isNearEndAcknowledged() {
  return hostNearEndAck || nearEndAckRequest;
}

// รหัสเตือนที่ใช้จริงในเครื่องนี้
uint8_t effectiveAlertCode() {
  if (!isRunning) return ALERT_NONE;
  if (isLocallyOccluded()) return ALERT_OCCLUSION;           // ตัดสินทันทีในเครื่อง
  if (isHostOnline) {
    uint8_t c = hostAlertCode;
    if (c == ALERT_OCCLUSION) c = ALERT_NONE;                // ข้อมูลในเครื่องใหม่กว่า
    return c;
  }
  if (totalPlanMl > 0 && totalVolumeMl >= totalPlanMl) return ALERT_COMPLETE;
  if (isNearEndReached()) return ALERT_NEAR_END;
  return ALERT_NONE;
}

bool isNearEndPending(uint8_t code) {
  return code == ALERT_NEAR_END && !isNearEndAcknowledged();
}

void acknowledgeNearEnd() {
  nearEndAckRequest = true;
  nearChimeRemaining = 0;
  noTone(BUZZER_PIN);
  beepNonBlocking(2600, 40);
}

float readStationBattery() {
#if STATION_BAT_ADC_PIN >= 0
  long sum = 0;
  for (int i = 0; i < 8; i++) sum += analogRead(STATION_BAT_ADC_PIN);
  float v = ((sum / 8.0f) / 4095.0f) * 3.3f * BAT_DIVIDER_RATIO;
  return (v < 2.5f) ? 0.0f : v;
#else
  return 0.0f;
#endif
}

void drawCenteredString(const String &str, int y, uint8_t size, uint16_t color, uint16_t bg) {
  int16_t x1, y1;
  uint16_t w, h;
  tft.setTextSize(size);
  tft.getTextBounds(str, 0, y, &x1, &y1, &w, &h);
  int x = (172 - (int)w) / 2;
  if (x < 0) x = 0;
  tft.setTextColor(color, bg);
  tft.setCursor(x, y);
  tft.print(str);
}

void setLedColor(uint8_t r, uint8_t g, uint8_t b) {
  neopixelWrite(RGB_LED_PIN, r, g, b);
}

void beepNonBlocking(uint16_t freq, uint16_t durationMs) {
  tone(BUZZER_PIN, freq);
  buzzerBeepUntil = millis() + durationMs;
}

void modalSafeBeep(uint16_t freq, uint16_t durationMs) {
  tone(BUZZER_PIN, freq);
  delay(durationMs);
  noTone(BUZZER_PIN);
  buzzerBeepUntil = 0;
}

void soundClick()       { beepNonBlocking(2600, 20); }
void soundStart()       { beepNonBlocking(2000, 70); }
void soundStop()        { beepNonBlocking(1000, 140); }
void soundScreensaver() { beepNonBlocking(1800, 40); }

void playWelcomeMelody() {
  int notes[] = { 1046, 1318, 1568, 2093 };
  for (int i = 0; i < 4; i++) {
    modalSafeBeep(notes[i], 80);
    delay(25);
  }
}

void handlePassiveBuzzerEngine(uint8_t code) {
  unsigned long now = millis();
  if (buzzerBeepUntil > 0 && now >= buzzerBeepUntil) {
    noTone(BUZZER_PIN);
    buzzerBeepUntil = 0;
  }

  // เสียงเตือนใกล้หมด: 3 ครั้งสั้น ๆ แล้วเงียบ 5 นาที (ดังเฉพาะเมื่อยังไม่มีเหตุวิกฤต)
  if (!isCriticalAlert(code)) {
    if (!isNearEndPending(code)) { nearChimeRemaining = 0; nearNextChimeTime = 0; return; }
    if (nearChimeRemaining == 0 && (nearNextChimeTime == 0 || now >= nearNextChimeTime)) {
      nearChimeRemaining = 3;
      buzzerNextBeepTime = now;
      nearNextChimeTime = now + NEAR_END_REMIND_MS;
    }
    if (nearChimeRemaining > 0 && now >= buzzerNextBeepTime) {
      beepNonBlocking(2000, 70);
      buzzerNextBeepTime = now + 220;
      nearChimeRemaining--;
    }
    return;
  }

  if (now < snoozeUntilTime) return;
  if (now < buzzerNextBeepTime) return;

  switch (code) {
    case ALERT_OCCLUSION: beepNonBlocking(1800, 150); buzzerNextBeepTime = now + 900;  break;
    case ALERT_TOO_FAST:  beepNonBlocking(2200, 80);  buzzerNextBeepTime = now + 700;  break;
    case ALERT_TOO_SLOW:  beepNonBlocking(1200, 120); buzzerNextBeepTime = now + 1200; break;
    case ALERT_COMPLETE:  beepNonBlocking(1500, 250); buzzerNextBeepTime = now + 1500; break;
  }
}

void updateStatusLed(uint8_t code) {
  static int lastLed = -1;
  int led;
  if (currentState == STATE_CONFIG_ID) led = 4;
  else if (isCriticalAlert(code) && millis() >= snoozeUntilTime) led = 0;
  else if (isNearEndPending(code)) led = 5;
  else if (!isRunning) led = 1;
  else if (!isHostOnline) led = 2;
  else led = 3;

  if (led == lastLed) return;
  lastLed = led;
  switch (led) {
    case 0: setLedColor(90, 0, 0);  break;
    case 1: setLedColor(60, 40, 0); break;
    case 2: setLedColor(0, 0, 60);  break;
    case 3: setLedColor(0, 30, 0);  break;
    case 4: setLedColor(50, 0, 50); break;
    case 5: setLedColor(90, 35, 0); break;
  }
}

void drawHoldProgressHUD(unsigned long holdDur) {
  int boxX = 6, boxY = 100, boxW = 160, boxH = 100;
  tft.fillRoundRect(boxX, boxY, boxW, boxH, 8, THEME_NAVY);
  tft.drawRoundRect(boxX, boxY, boxW, boxH, 8, THEME_CYAN);

