kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_6_0/ESP32-S3-Station-V_7_6_0.ino
  int barX = boxX + 15;
  int barY = boxY + 48;
  int barW = 130;
  int barH = 12;

  if (holdDur < 3000) {
    int fill = map(holdDur, 400, 3000, 0, barW);
    if (fill < 0) fill = 0;
    if (fill > barW) fill = barW;

    drawCenteredString("BUTTON HOLDING", boxY + 12, 1, THEME_SKYBLUE, THEME_NAVY);
    drawCenteredString("-> SENSOR TEST (3s)", boxY + 28, 1, COLOR_YELLOW, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, fill, barH - 2, THEME_PINK);
    drawCenteredString("Release <3s = Cancel", boxY + 82, 1, ST77XX_LIGHTGREY, THEME_NAVY);
  }
  else if (holdDur < 5000) {
    int fill = map(holdDur, 3000, 5000, 0, barW);
    if (fill < 0) fill = 0;
    if (fill > barW) fill = barW;

    drawCenteredString("RELEASE = TEST", boxY + 12, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("-> CREDITS (5s)", boxY + 28, 1, THEME_PINK, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, fill, barH - 2, THEME_CYAN);
  }
  else {
    drawCenteredString(">> CREDITS READY <<", boxY + 14, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("RELEASE TO VIEW", boxY + 30, 1, COLOR_YELLOW, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, barW - 2, barH - 2, COLOR_GREEN);
  }
}

// ----------------------------------------------------------------------------
// หน้าทดสอบเซ็นเซอร์ (กดปุ่มค้าง 3 วินาที) — ใช้ตอนติดตั้งและตอนปรับโวลุ่มบนโมดูล
// เป้าหมาย: หยด 1 หยด ต้องได้พัลส์พอดี 1 พัลส์ ความกว้างราว 20-80 ms
// ----------------------------------------------------------------------------
void executeSensorTestScreen() {
  noTone(BUZZER_PIN);
  buzzerBeepUntil = 0;

  tft.fillScreen(THEME_BG);
  tft.fillRect(0, 0, 172, 28, THEME_PINK);
  drawCenteredString("SENSOR TEST", 8, 1, COLOR_WHITE, THEME_PINK);
  drawCenteredString("TURN THE TRIMMER UNTIL", 38, 1, THEME_SKYBLUE, THEME_BG);
  drawCenteredString("1 DROP = 1 PULSE", 54, 1, COLOR_YELLOW, THEME_BG);

  tft.fillRoundRect(6, 74, 160, 56, 8, THEME_NAVY);
  drawCenteredString("LINE LEVEL", 80, 1, UI_DIM, THEME_NAVY);
  tft.fillRoundRect(6, 138, 160, 56, 8, THEME_NAVY);
  drawCenteredString("PULSES", 144, 1, UI_DIM, THEME_NAVY);
  tft.fillRoundRect(6, 202, 160, 80, 8, THEME_NAVY);
  drawCenteredString("LAST PULSE", 208, 1, UI_DIM, THEME_NAVY);
  drawCenteredString("CLICK = EXIT", 300, 1, COLOR_WHITE, THEME_BG);

  uint32_t baseCount  = dropIsrCount;
  bool     lastLevel  = dropLineActive();
  uint32_t riseUs     = 0;
  uint32_t lastRiseUs = 0;
  float    widthMs    = -1.0f;
  float    gapMs      = -1.0f;

  String cacheLevel = "", cacheCount = "", cacheTiming = "";
  unsigned long lastDraw = 0;

  while (digitalRead(BTN_PIN) == HIGH) {
    // อ่านระดับสัญญาณถี่ ๆ เพื่อวัดความกว้างพัลส์ (ISR ทำหน้าที่นับจำนวนอยู่แล้ว)
    bool level = dropLineActive();
    if (level != lastLevel) {
      uint32_t nowUs = micros();
      if (level) {
        if (lastRiseUs != 0) gapMs = (float)(uint32_t)(nowUs - lastRiseUs) / 1000.0f;
        lastRiseUs = nowUs;
        riseUs = nowUs;
      } else if (riseUs != 0) {
        widthMs = (float)(uint32_t)(nowUs - riseUs) / 1000.0f;
      }
      lastLevel = level;
    }

    if (millis() - lastDraw >= 80) {
      lastDraw = millis();

      String lv = level ? "HIGH" : "LOW";
      if (lv != cacheLevel) {
        cacheLevel = lv;
        tft.fillRect(10, 96, 152, 26, THEME_NAVY);
        drawCenteredString(lv, 96, 3, level ? COLOR_YELLOW : ST77XX_LIGHTGREY, THEME_NAVY);
      }

      String cnt = String((uint32_t)(dropIsrCount - baseCount));
      if (cnt != cacheCount) {
        cacheCount = cnt;
        tft.fillRect(10, 160, 152, 26, THEME_NAVY);
        drawCenteredString(cnt, 160, 3, COLOR_WHITE, THEME_NAVY);
      }

      String w = (widthMs < 0) ? String("WIDTH  --") : ("WIDTH  " + String(widthMs, 1) + " ms");
      String g = (gapMs < 0)   ? String("GAP    --")
                               : ("GAP  " + String(gapMs / 1000.0f, 2) + " s  " +
                                  String(60000.0f / gapMs, 0) + " gtt/min");
      String timing = w + "|" + g;
      if (timing != cacheTiming) {
        cacheTiming = timing;
        tft.fillRect(10, 224, 152, 52, THEME_NAVY);
        drawCenteredString(w, 226, 1, COLOR_WHITE, THEME_NAVY);
        drawCenteredString(g, 244, 1, THEME_SKYBLUE, THEME_NAVY);
        if (dropIsrDropped > 0)
          drawCenteredString("QUEUE OVERFLOW " + String(dropIsrDropped), 262, 1, COLOR_RED, THEME_NAVY);
        else if (widthMs >= 0 && widthMs < 3.0f)
          drawCenteredString("PULSE TOO SHORT", 262, 1, COLOR_YELLOW, THEME_NAVY);
      }
    }
    delay(2);
  }

  modalSafeBeep(2400, 40);
  while (digitalRead(BTN_PIN) == LOW) delay(10);
  delay(60);

  // พัลส์ที่เกิดระหว่างทดสอบต้องไม่ถูกนับเป็นหยดจริง และต้องไม่ทำให้เตือนสายพับทันที
  clearDropQueue();
  if (hasFirstDropOccurred) {
    lastDropTimestamp = millis();
    lastDropMicros    = micros();
    skipNextInterval  = true;
  }
  lastUserActivityTime = millis();
  stateNeedsRedraw = true;
}

// ----------------------------------------------------------------------------
// ESP-NOW Receive Callback (รับ Sync จาก Host)
// ----------------------------------------------------------------------------
#if defined(ESP_IDF_VERSION) && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void OnTimeSyncRecv(const esp_now_recv_info_t *info, const uint8_t *incomingDataBytes, int len) {
  int rssi = (info && info->rx_ctrl) ? info->rx_ctrl->rssi : -55;
#else
void OnTimeSyncRecv(const uint8_t *mac, const uint8_t *incomingDataBytes, int len) {
  int rssi = -55;
#endif
  if (len != sizeof(struct_host_sync)) return;   // แพ็กเก็ตของ Station อื่น (22 bytes) จะถูกกรองออก

  struct_host_sync syncData;
  memcpy(&syncData, incomingDataBytes, sizeof(syncData));
  lastHostRssi = rssi;
  lastHostRecvTime = millis();
  isHostOnline = true;
  hostReportedChannel = syncData.hostChannel;

  if (syncData.epochTime > 1600000000) {
    struct timeval tv = { (time_t)syncData.epochTime, 0 };
    settimeofday(&tv, NULL);
    isClockSynced = (syncData.isSynced == 1);
  }

  if (syncData.stationId == currentStationId) {
    targetRateHr  = syncData.targetRateHr;
    totalPlanMl   = syncData.totalPlanMl;
    hostAlertCode = syncData.alertCode;
    dropFactor    = safeDropFactor(syncData.dropFactor);
    nearEndPct    = safeNearPct(syncData.nearEndPct);
    hostNearEndAck = (syncData.flags & 0x01) != 0;
    if (hostNearEndAck) nearEndAckRequest = false;   // Host ยืนยันแล้ว

    if (knownResetSeq < 0) {
      knownResetSeq = syncData.resetSeq;          // ครั้งแรกหลังบูต: รับค่าโดยไม่รีเซ็ต
    } else if (syncData.resetSeq != (uint8_t)knownResetSeq) {
      knownResetSeq = syncData.resetSeq;
      pendingCounterReset = true;                  // ให้ loop() เป็นผู้รีเซ็ต
    }
  }
}

void applyCounterReset() {
  pendingCounterReset = false;
  totalDrops = 0;
  periodDropsCounter = 0;
  totalVolumeMl = 0;
  currentFlowRate_ml_hr = 0;
  currentGttMin = 0;
  hasFirstDropOccurred = false;
  skipNextInterval = false;
  isDropFalling = false;
  snoozeUntilTime = 0;
  hostAlertCode = ALERT_NONE;
  hostNearEndAck = false;
  nearEndAckRequest = false;
  nearNextChimeTime = 0;
  nearChimeRemaining = 0;
  if (currentState == STATE_EMERGENCY || currentState == STATE_NEAR_END_NOTICE) currentState = STATE_NORMAL_VIEW;
  resetTrendData();                 // เริ่มถุงใหม่ = เริ่มกราฟแนวโน้มใหม่
  stateNeedsRedraw = true;
  beepNonBlocking(2400, 120);
}

// ----------------------------------------------------------------------------
// ค้นหาช่องสัญญาณของ Host
// ----------------------------------------------------------------------------
void setEspNowChannel(uint8_t ch) {
  if (esp_wifi_set_channel(ch, WIFI_SECOND_CHAN_NONE) == ESP_OK) {
    espnowChannel = ch;
  }
}

void manageChannelHunting(unsigned long now) {
  if (isHostOnline) {
    if (espnowChannel != savedChannel) {
      savedChannel = espnowChannel;
      stationPrefs.begin("st_cfg", false);
      stationPrefs.putUChar("ch", savedChannel);
      stationPrefs.end();
    }
    return;
  }
  if (now < CHANNEL_SCAN_START_MS) return;
  if (currentState == STATE_CONFIG_ID) return;

  if (now - lastChannelHopTime >= CHANNEL_SCAN_DWELL_MS) {
    lastChannelHopTime = now;
    uint8_t next = (espnowChannel % MAX_WIFI_CHANNEL) + 1;
    setEspNowChannel(next);
  }
}

// ----------------------------------------------------------------------------
// ตรวจจับหยดน้ำจากเซ็นเซอร์เอาต์พุตดิจิทัล
//   ISR เก็บเฉพาะ "เวลาที่เกิดพัลส์" ลงคิว ทำงานสั้นที่สุดเท่าที่จะทำได้
//   ส่วนการคำนวณอัตราไหลทั้งหมดอยู่ใน serviceDropSensor() ที่ลูปหลักเรียก
// ----------------------------------------------------------------------------
void IRAM_ATTR onDropEdgeIsr() {
  static uint32_t lastAcceptedUs = 0;
  uint32_t nowUs = micros();
  if ((uint32_t)(nowUs - lastAcceptedUs) < (uint32_t)DROP_DEBOUNCE_MS * 1000UL) return;
  lastAcceptedUs = nowUs;
  dropIsrCount++;

  uint8_t next = (uint8_t)((dropQHead + 1) % DROP_QUEUE_SIZE);
  if (next == dropQTail) {          // คิวเต็ม (ลูปหลักค้างนานผิดปกติ) — นับไว้ให้เห็นในหน้าทดสอบ
    dropIsrDropped++;
    return;
  }
  dropQueueUs[dropQHead] = nowUs;
  dropQHead = next;
}

bool popDropEvent(uint32_t &outUs) {
  bool got = false;
  noInterrupts();
  if (dropQTail != dropQHead) {
    outUs = dropQueueUs[dropQTail];
    dropQTail = (uint8_t)((dropQTail + 1) % DROP_QUEUE_SIZE);
    got = true;
  }
  interrupts();
  return got;
}

