kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_6_0/ESP32-S3-Station-V_7_6_0.ino
void clearDropQueue() {
  noInterrupts();
  dropQTail = dropQHead;
  interrupts();
}

// คำนวณผลของหยด 1 หยดที่เกิดขึ้นเมื่อเวลา eventUs (หน่วยไมโครวินาทีจาก micros())
void registerDrop(uint32_t eventUs) {
  unsigned long now = millis();

  totalDrops++;
  periodDropsCounter++;

  isDropFalling = true;
  dropFallStartTime = now;
  animDropY = CHAMBER_NOZZLE_Y;

  uint8_t df = safeDropFactor(dropFactor);
  if (hasFirstDropOccurred && !skipNextInterval) {
    // ลบกันแบบ uint32 จึงถูกต้องแม้ micros() จะวนรอบ (ทุก ~71 นาที)
    unsigned long dropDeltaMs = (unsigned long)((uint32_t)(eventUs - lastDropMicros) / 1000UL);
    if (dropDeltaMs > minDropInterval && dropDeltaMs < MAX_OCCLUSION_MS) {
      float instantGttMin   = 60000.0f / (float)dropDeltaMs;
      float instantRateMlHr = (instantGttMin * 60.0f) / (float)df;

      if (currentFlowRate_ml_hr == 0.0f) {
        currentFlowRate_ml_hr = instantRateMlHr;
      } else {
        currentFlowRate_ml_hr = (instantRateMlHr * 0.75f) + (currentFlowRate_ml_hr * 0.25f);
      }
    }
  }
  hasFirstDropOccurred = true;
  skipNextInterval = false;
  lastDropMicros    = eventUs;
  lastDropTimestamp = now;
  currentGttMin = (currentFlowRate_ml_hr * (float)df) / 60.0f;
  totalVolumeMl = (float)totalDrops / (float)df;
}

void serviceDropSensor() {
  uint32_t eventUs;
  if (!isRunning) {          // ขณะหยุดชั่วคราว: ทิ้งพัลส์ที่เข้ามา ไม่นับเป็นหยด
    clearDropQueue();
    return;
  }
  while (popDropEvent(eventUs)) registerDrop(eventUs);
}

// เริ่มใช้งานขาเซ็นเซอร์ + ตรวจว่าสายไม่ได้ค้างอยู่ที่ระดับ "มีหยด"
void initDropSensor() {
#if DROP_ACTIVE_HIGH
  pinMode(DROP_DO_PIN, INPUT_PULLDOWN);   // ว่าง = LOW, มีหยด = HIGH
#else
  pinMode(DROP_DO_PIN, INPUT_PULLUP);     // ว่าง = HIGH, มีหยด = LOW
#endif
  delay(5);

  int activeCount = 0;
  for (int i = 0; i < 50; i++) {
    if (dropLineActive()) activeCount++;
    delay(2);
  }
  sensorLineStuck = (activeCount >= 48);  // ค้างเกือบตลอด 100 ms = ต่อสายผิดหรือปรับโวลุ่มเลยจุด

#if DROP_ACTIVE_HIGH
  attachInterrupt(digitalPinToInterrupt(DROP_DO_PIN), onDropEdgeIsr, RISING);
#else
  attachInterrupt(digitalPinToInterrupt(DROP_DO_PIN), onDropEdgeIsr, FALLING);
#endif
  clearDropQueue();
}

void togglePause() {
  isRunning = !isRunning;
  currentFlowRate_ml_hr = 0.0f;
  currentGttMin = 0.0f;
  if (isRunning) {
    soundStart();
    // เริ่มนับเวลาใหม่หลังกลับมาทำงาน ไม่ให้ช่วงที่หยุดถูกนับเป็นสายพับหรือใช้คำนวณ rate
    if (hasFirstDropOccurred) {
      lastDropTimestamp = millis();
      skipNextInterval = true;
    }
  } else {
    soundStop();
    noTone(BUZZER_PIN);
  }
  stateNeedsRedraw = true;
}

String getStationClockStr() {
  if (!isClockSynced) return String("--:--");
  time_t now;
  time(&now);
  struct tm *timeinfo = localtime(&now);
  char buf[12];
  strftime(buf, sizeof(buf), "%H:%M", timeinfo);
  return String(buf);
}

// ============================================================================
// ส่วนแสดงผล (UI v2) — เน้นอ่านง่ายจากปลายเตียง ใช้ข้อความเท่าที่จำเป็น
//   หน้า 1 IV BAG  : ภาพถุงน้ำเกลือ + กระเปาะหยด + ตัวเลขสำคัญ 4 ค่า
//   หน้า 2 PLAN    : แผนการให้สารน้ำและเวลา (ตัวเลขใหญ่ 4 ค่า)
//   หน้า 3 LINK    : สถานะการเชื่อมต่อและเซนเซอร์
//   หน้า 4 TREND   : กราฟแท่งแนวโน้มอัตราไหลย้อนหลัง 30 นาที
// ทุกหน้าวาดเฉพาะส่วนที่ค่าเปลี่ยน เพื่อไม่ให้ SPI แย่งเวลาการอ่านเซนเซอร์
// ============================================================================

UiStatus uiStatusOf(uint8_t code) {
  if (!isRunning) return UI_PAUSED;
  switch (code) {
    case ALERT_OCCLUSION: return UI_NOFLOW;
    case ALERT_TOO_FAST:  return UI_FAST;
    case ALERT_TOO_SLOW:  return UI_SLOW;
    case ALERT_COMPLETE:  return UI_DONE;
    case ALERT_NEAR_END:  return UI_NEAREND;
    default:              return UI_OK;
  }
}

uint16_t uiStatusColor(UiStatus s) {
  switch (s) {
    case UI_OK:      return UI_GREEN;
    case UI_FAST:    return COLOR_ORANGE;
    case UI_SLOW:    return COLOR_YELLOW;
    case UI_NOFLOW:  return COLOR_RED;
    case UI_NEAREND: return COLOR_ORANGE;
    case UI_DONE:    return THEME_CYAN;
    default:         return THEME_SKYBLUE;
  }
}

const char* uiStatusWord(UiStatus s) {
  switch (s) {
    case UI_OK:      return "NORMAL";
    case UI_FAST:    return "TOO FAST";
    case UI_SLOW:    return "TOO SLOW";
    case UI_NOFLOW:  return "NO FLOW";
    case UI_NEAREND: return "NEXT BAG";
    case UI_DONE:    return "COMPLETE";
    default:         return "PAUSED";
  }
}

// ---- ตัวช่วยวางข้อความ (ฟอนต์มาตรฐาน: 1 ตัวอักษร = 6xsize กว้าง, 8xsize สูง) ----
void textAt(const String &s, int x, int y, uint8_t size, uint16_t col, uint16_t bg) {
  tft.setTextSize(size);
  tft.setTextColor(col, bg);
  tft.setCursor(x, y);
  tft.print(s);
}

void textRight(const String &s, int xRight, int y, uint8_t size, uint16_t col, uint16_t bg) {
  textAt(s, xRight - (int)s.length() * 6 * size, y, size, col, bg);
}

void textCenterIn(const String &s, int x, int w, int y, uint8_t size, uint16_t col, uint16_t bg) {
  textAt(s, x + (w - (int)s.length() * 6 * size) / 2, y, size, col, bg);
}

// เติมช่องว่างท้ายข้อความให้ยาวคงที่ เพื่อเขียนทับของเดิมได้โดยไม่ต้องล้างพื้นที่ (ไม่กะพริบ)
String padTo(const String &s, unsigned int width) {
  String out = s;
  while (out.length() < width) out += ' ';
  return out;
}

// ---- ค่าที่ใช้ร่วมกันหลายหน้า ----
int remainingMlInt() {
  float r = totalPlanMl - totalVolumeMl;
  if (r < 0) r = 0;
  return (int)(r + 0.5f);
}

int infusedPct() {
  if (totalPlanMl <= 0) return -1;
  int p = (int)(totalVolumeMl * 100.0f / totalPlanMl + 0.5f);
  return (p > 100) ? 100 : p;
}

// นาทีที่เหลือจนหมดถุง (-1 = คำนวณไม่ได้)
int minutesLeft() {
  if (totalPlanMl <= 0) return -1;
  if (!isRunning || isLocallyOccluded()) return -1;
  float calcRate = (currentFlowRate_ml_hr > 5.0f) ? currentFlowRate_ml_hr : (float)targetRateHr;
  if (calcRate <= 0) return -1;
  return (int)((remainingMlInt() / calcRate) * 60.0f);
}

String timeLeftText(bool compact) {
  int m = minutesLeft();
  if (m < 0) return compact ? String("--h--m") : String("--h --m");
  char b[16];
  snprintf(b, sizeof(b), compact ? "%dh%02dm" : "%dh %02dm", m / 60, m % 60);
  return String(b);
}

String endClockText() {
  int m = minutesLeft();
  if (!isClockSynced || m < 0) return String("--:--");
  time_t now;
  time(&now);
  time_t fin = now + ((time_t)m * 60);
  char buf[8];
  strftime(buf, sizeof(buf), "%H:%M", localtime(&fin));
  return String(buf);
}

