kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_6_0/ESP32-S3-Station-V_7_6_0.ino
// ---- แถบสัญญาณ Host ----
void drawLinkBars(int x, int y, int rssi, bool online) {
  int bars = 0;
  uint16_t col = UI_GREEN;
  if (online) {
    if (rssi >= -65)      { bars = 4; col = UI_GREEN; }
    else if (rssi >= -75) { bars = 3; col = THEME_CYAN; }
    else if (rssi >= -85) { bars = 2; col = COLOR_ORANGE; }
    else                  { bars = 1; col = COLOR_RED; }
  }
  int h[4] = {4, 7, 10, 13};
  for (int i = 0; i < 4; i++) {
    int bx = x + i * 4;
    tft.fillRect(bx, y + (13 - h[i]), 3, h[i], (i < bars) ? col : UI_LINE);
  }
  if (!online) {
    tft.drawLine(x, y, x + 14, y + 13, COLOR_RED);
    tft.drawLine(x, y + 13, x + 14, y, COLOR_RED);
  }
}

// ---- แถบบนสุด: ป้ายเตียงสีตามสถานะ | นาฬิกา | สัญญาณ ----
void drawTopBar(bool force) {
  UiStatus st = uiStatusOf(uiAlertCode);
  String clockStr = getStationClockStr();
  int bars = isHostOnline ? lastHostRssi : -999;

  if (force) {
    tft.fillRect(0, 0, 172, 22, UI_BAR);
    tft.fillRect(0, 22, 172, 2, uiStatusColor(st));
    cacheStatusBar = (int)st;
    cacheClock = "";
    cacheBars = -9999;
  } else if ((int)st != cacheStatusBar) {
    cacheStatusBar = (int)st;
    tft.fillRect(0, 22, 172, 2, uiStatusColor(st));
    cacheBedChip = false;
  }

  if (!cacheBedChip || force) {
    cacheBedChip = true;
    char bed[8];
    snprintf(bed, sizeof(bed), "B%02d", currentStationId);
    tft.fillRoundRect(4, 3, 30, 16, 4, uiStatusColor(st));
    textCenterIn(String(bed), 4, 30, 7, 1, THEME_BG, uiStatusColor(st));
  }

  if (clockStr != cacheClock) {
    cacheClock = clockStr;
    textCenterIn(clockStr, 46, 80, 7, 1, COLOR_WHITE, UI_BAR);
  }

  int barKey = (bars == -999) ? -999 : (bars / 5);
  if (barKey != cacheBars) {
    cacheBars = barKey;
    tft.fillRect(148, 4, 18, 14, UI_BAR);
    drawLinkBars(150, 4, lastHostRssi, isHostOnline);
  }
}

// ---- จุดบอกหน้า ----
void drawPageDots(int activeIdx, int y) {
  int count = 4;
  int w = count * 12 - 6;
  int x = (172 - w) / 2;
  tft.fillRect(0, y - 2, 172, 8, THEME_BG);
  for (int i = 0; i < count; i++) {
    if (i == activeIdx) tft.fillRoundRect(x + i * 12, y, 8, 4, 2, THEME_SKYBLUE);
    else                tft.fillRoundRect(x + i * 12, y, 6, 4, 2, UI_LINE);
  }
}

// ---- แถบความคืบหน้า ----
void drawProgressBar(int x, int y, int w, int h, int pct, uint16_t fill) {
  if (pct < 0) pct = 0;
  if (pct > 100) pct = 100;
  tft.fillRoundRect(x, y, w, h, h / 2, UI_CARD);
  int fw = w * pct / 100;
  if (fw >= h) tft.fillRoundRect(x, y, fw, h, h / 2, fill);
  else if (fw > 0) tft.fillRect(x, y, fw, h, fill);
}

// ============================================================================
// หน้า 1: IV BAG — ภาพถุงน้ำเกลือ + กระเปาะหยด + ตัวเลขสำคัญ
// ============================================================================
#define BAG_X       12
#define BAG_Y       34
#define BAG_W       58
#define BAG_H       124
#define CH_X        26
#define CH_Y        176
#define CH_W        30
#define CH_H        46
#define DROP_X      41
#define RIGHT_X     84

// ระดับน้ำในถุง (วาดใหม่เมื่อเปอร์เซ็นต์เปลี่ยนเท่านั้น)
void drawBagLevel(bool force) {
  int pct = infusedPct();
  int left = (pct < 0) ? 100 : (100 - pct);
  uint16_t liquid = (uiAlertCode == ALERT_NEAR_END) ? COLOR_ORANGE : THEME_CYAN;
  if (!force && left == cacheBagPct) return;
  cacheBagPct = left;

  int innerX = BAG_X + 4, innerY = BAG_Y + 12;
  int innerW = BAG_W - 8, innerH = BAG_H - 8;
  tft.fillRect(innerX, innerY, innerW, innerH, THEME_BG);
  int fillH = innerH * left / 100;
  if (fillH > 3) tft.fillRoundRect(innerX, innerY + (innerH - fillH), innerW, fillH, 4, liquid);
  for (int i = 1; i < 4; i++)
    tft.drawFastHLine(BAG_X + BAG_W - 9, innerY + innerH * i / 4, 5, UI_DIM);

  String s = (pct < 0) ? String("-- LEFT") : (String(left) + "% LEFT");
  textCenterIn(padTo(s, 10), 2, 76, 236, 1, liquid, THEME_BG);
}

void drawChamberStatic() {
  tft.drawRoundRect(CH_X, CH_Y, CH_W, CH_H, 5, COLOR_WHITE);
  tft.fillRect(DROP_X - 1, CH_Y + 4, 3, 6, COLOR_WHITE);
}

// โหมด 0 = รอหยด, 1 = หยดกำลังตก, 2 = พักการนับ, 3 = ไม่มีการไหล
void updateDripAnimation() {
  if (currentState != STATE_NORMAL_VIEW || currentNursePage != 1 || stateNeedsRedraw) return;

  unsigned long now = millis();
  int8_t mode;
  if (!isRunning) mode = 2;
  else if (isDropFalling) mode = 1;
  else if (isLocallyOccluded()) mode = 3;
  else mode = 0;

  if (mode != animModeDrawn) {
    tft.fillRect(CH_X + 2, CH_Y + 12, CH_W - 4, CH_H - 14, THEME_BG);
    drawChamberStatic();
    if (mode == 2) {
      tft.fillRect(DROP_X - 6, CH_Y + 16, 4, 14, COLOR_YELLOW);
      tft.fillRect(DROP_X + 3, CH_Y + 16, 4, 14, COLOR_YELLOW);
    } else if (mode == 3) {
      textAt("!", DROP_X - 5, CH_Y + 15, 2, COLOR_RED, THEME_BG);
    } else {
      tft.fillCircle(DROP_X, CHAMBER_NOZZLE_Y, 2, THEME_CYAN);
    }
    if (mode != 2 && mode != 3) tft.fillRoundRect(CH_X + 3, CH_Y + 32, CH_W - 6, 10, 3, THEME_CYAN);
    animModeDrawn = mode;
    animDropPrevY = CHAMBER_NOZZLE_Y;
    lastAnimFrame = 0;
  }

  if (mode == 1) {
    if (now - lastAnimFrame < 20) return;
    lastAnimFrame = now;
    unsigned long elapsed = now - dropFallStartTime;
    if (elapsed <= DROP_FALL_DURATION) {
      animDropY = CHAMBER_NOZZLE_Y + (int)((float)elapsed / (float)DROP_FALL_DURATION * (CHAMBER_POOL_Y - CHAMBER_NOZZLE_Y));
      if (animDropY != animDropPrevY) {
        tft.fillCircle(DROP_X, animDropPrevY, 2, THEME_BG);
        tft.fillCircle(DROP_X, animDropY, 2, THEME_CYAN);
        animDropPrevY = animDropY;
      }
    } else {
      tft.fillCircle(DROP_X, animDropPrevY, 2, THEME_BG);
      tft.fillRoundRect(CH_X + 3, CH_Y + 30, CH_W - 6, 12, 3, COLOR_WHITE);   // กระเพื่อมที่ผิวน้ำ
      poolFlashUntil = now + 110;
      isDropFalling = false;
    }
  } else if (mode == 0 && poolFlashUntil > 0 && now >= poolFlashUntil) {
    tft.fillRoundRect(CH_X + 3, CH_Y + 32, CH_W - 6, 10, 3, THEME_CYAN);
    tft.fillRect(CH_X + 3, CH_Y + 30, CH_W - 6, 2, THEME_BG);
    poolFlashUntil = 0;
  }
}

void drawPage1Framework() {
  tft.fillScreen(THEME_BG);
  drawTopBar(true);

  tft.fillRect(BAG_X + BAG_W / 2 - 1, BAG_Y, 3, 8, UI_LINE);            // ห่วงแขวน
  tft.drawRoundRect(BAG_X, BAG_Y + 8, BAG_W, BAG_H, 6, COLOR_WHITE);
  tft.fillRect(DROP_X - 1, BAG_Y + BAG_H + 8, 3, 10, UI_LINE);          // สายจากถุงลงกระเปาะ
  drawChamberStatic();
  tft.fillRoundRect(CH_X + 3, CH_Y + 32, CH_W - 6, 10, 3, THEME_CYAN);  // ผิวน้ำในกระเปาะ
  tft.fillRect(DROP_X - 1, CH_Y + CH_H, 3, 8, UI_LINE);                 // สายออกจากกระเปาะ

