kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_6_0/ESP32-S3-Station-V_7_6_0.ino
  textAt("RATE", RIGHT_X + 4, 36, 1, UI_DIM, THEME_BG);
  textAt("mL/h", RIGHT_X + 4, 82, 1, UI_DIM, THEME_BG);
  tft.drawFastHLine(RIGHT_X + 2, 110, 82, UI_LINE);
  textAt("LEFT", RIGHT_X + 4, 118, 1, UI_DIM, THEME_BG);
  tft.drawFastHLine(RIGHT_X + 2, 154, 82, UI_LINE);
  textAt("TIME LEFT", RIGHT_X + 4, 160, 1, UI_DIM, THEME_BG);

  drawPageDots(0, 308);

  cacheBagPct = -999; cacheRate = -9999; cacheTarget = -9999; cacheLeftMl = -9999;
  cachePct = -999; cacheTimeLeft = ""; cacheEndClock = ""; cacheStatusWord = "";
  animModeDrawn = -1;
  poolFlashUntil = 0;
  stateNeedsRedraw = false;
}

void updatePage1Dynamic() {
  drawTopBar(false);
  drawBagLevel(false);

  UiStatus st = uiStatusOf(uiAlertCode);
  int rate = isRunning ? (int)(currentFlowRate_ml_hr + 0.5f) : -1;
  int target = (int)(targetRateHr + 0.5f);

  if (rate != cacheRate || target != cacheTarget) {
    cacheRate = rate; cacheTarget = target;
    tft.fillRect(RIGHT_X + 4, 48, 84, 32, THEME_BG);
    if (!isRunning) textAt("--", RIGHT_X + 4, 48, 4, THEME_SKYBLUE, THEME_BG);
    else textAt(String(rate), RIGHT_X + 4, 48, 4, (st == UI_NOFLOW) ? COLOR_RED : COLOR_WHITE, THEME_BG);
    textAt(padTo(targetRateHr > 0 ? ("SET " + String(target)) : String("SET --"), 9),
           RIGHT_X + 4, 94, 1, THEME_SKYBLUE, THEME_BG);
  }

  int left = (totalPlanMl > 0) ? remainingMlInt() : -1;
  if (left != cacheLeftMl) {
    cacheLeftMl = left;
    textAt(padTo(left >= 0 ? (String(left) + " mL") : String("-- mL"), 7), RIGHT_X + 4, 130, 2, COLOR_WHITE, THEME_BG);
  }

  String tl = timeLeftText(true);
  if (tl != cacheTimeLeft) {
    cacheTimeLeft = tl;
    textAt(padTo(tl, 7), RIGHT_X + 4, 172, 2, COLOR_WHITE, THEME_BG);
  }

  String ec = endClockText();
  if (ec != cacheEndClock) {
    cacheEndClock = ec;
    textAt(padTo("END " + ec, 11), RIGHT_X + 4, 196, 1, UI_DIM, THEME_BG);
  }

  String word = String(uiStatusWord(st));
  if (word != cacheStatusWord) {
    cacheStatusWord = word;
    uint16_t sc = uiStatusColor(st);
    tft.fillRoundRect(RIGHT_X, 214, 84, 40, 6, sc);
    textCenterIn(word, RIGHT_X, 84, 229, 1, THEME_BG, sc);
  }

  int pct = infusedPct();
  if (pct != cachePct) {
    cachePct = pct;
    String line = (totalPlanMl > 0)
      ? ("INFUSED " + String((int)totalVolumeMl) + "/" + String((int)totalPlanMl) + " mL")
      : ("INFUSED " + String((int)totalVolumeMl) + " mL");
    textAt(padTo(line, 22), 12, 272, 1, UI_DIM, THEME_BG);
    textRight(padTo(pct >= 0 ? (String(pct) + "%") : String("--"), 4), 164, 272, 1, COLOR_WHITE, THEME_BG);
    drawProgressBar(12, 286, 148, 12, (pct < 0) ? 0 : pct,
                    (uiAlertCode == ALERT_NEAR_END) ? COLOR_ORANGE : THEME_CYAN);
  }
}

// ============================================================================
// หน้า 2: PLAN — แผนการให้สารน้ำและเวลา (ตัวเลขใหญ่ 4 ค่า)
// ============================================================================
void drawStatCard(int y, const char* label, const String &value, uint16_t valueColor, bool labelOnly) {
  if (labelOnly) {
    tft.fillRoundRect(6, y, 160, 46, 6, UI_CARD);
    textAt(String(label), 14, y + 7, 1, UI_DIM, UI_CARD);
    return;
  }
  tft.fillRect(60, y + 18, 100, 26, UI_CARD);
  textRight(value, 158, y + 20, 3, valueColor, UI_CARD);
}

void drawPage2Framework() {
  tft.fillScreen(THEME_BG);
  drawTopBar(true);
  drawStatCard(30,  "TARGET   mL/h", "", 0, true);
  drawStatCard(84,  "PLAN   mL",     "", 0, true);
  drawStatCard(138, "INFUSED   mL",  "", 0, true);
  drawStatCard(192, "FINISH AT",     "", 0, true);
  drawPageDots(1, 308);
  cacheP2a = ""; cacheP2b = ""; cacheP2c = ""; cacheP2d = ""; cacheP2foot = "";
  stateNeedsRedraw = false;
}

void updatePage2Dynamic() {
  drawTopBar(false);

  String v1 = (targetRateHr > 0) ? String((int)(targetRateHr + 0.5f)) : String("--");
  String v2 = (totalPlanMl > 0) ? String((int)totalPlanMl) : String("--");
  String v3 = String((int)totalVolumeMl);
  String v4 = endClockText();

  if (v1 != cacheP2a) { cacheP2a = v1; drawStatCard(30,  "", v1, THEME_SKYBLUE, false); }
  if (v2 != cacheP2b) { cacheP2b = v2; drawStatCard(84,  "", v2, COLOR_WHITE,   false); }
  if (v3 != cacheP2c) { cacheP2c = v3; drawStatCard(138, "", v3, COLOR_WHITE,   false); }
  if (v4 != cacheP2d) { cacheP2d = v4; drawStatCard(192, "", v4, UI_GREEN,      false); }

  String foot = timeLeftText(false) + " left";
  String foot2 = (totalPlanMl > 0)
      ? ("NEXT BAG AT " + String(safeNearPct(nearEndPct)) + "%")
      : String("NEXT BAG AT --");
  String key = foot + foot2;
  if (key != cacheP2foot) {
    cacheP2foot = key;
    textCenterIn(padTo(foot, 12), 6, 160, 248, 2, COLOR_WHITE, THEME_BG);
    textCenterIn(padTo(foot2, 20), 6, 160, 274, 1, COLOR_ORANGE, THEME_BG);
  }
}

// ============================================================================
// หน้า 3: LINK — สถานะการเชื่อมต่อและเซนเซอร์
// ============================================================================
void drawPage3Framework() {
  tft.fillScreen(THEME_BG);
  drawTopBar(true);

  tft.fillRoundRect(6, 30, 160, 60, 6, UI_CARD);
  textAt("HOST LINK", 14, 36, 1, UI_DIM, UI_CARD);

  tft.fillRoundRect(6, 98, 160, 86, 6, UI_CARD);
  textAt("SENSOR", 14, 104, 1, UI_DIM, UI_CARD);

  tft.fillRoundRect(6, 192, 160, 76, 6, UI_CARD);
  textAt("DEVICE", 14, 198, 1, UI_DIM, UI_CARD);

  drawPageDots(2, 308);
  cacheP3a = ""; cacheP3b = ""; cacheP3c = "";
  stateNeedsRedraw = false;
}

void updatePage3Dynamic() {
  drawTopBar(false);

  String linkKey = String(isHostOnline ? 1 : 0) + ":" + String(lastHostRssi / 5) + ":" + String(espnowChannel);
  if (linkKey != cacheP3a) {
    cacheP3a = linkKey;
    textAt(padTo(isHostOnline ? "ONLINE" : "NO LINK", 8), 14, 50, 2, isHostOnline ? UI_GREEN : COLOR_RED, UI_CARD);
    tft.fillRect(134, 48, 20, 16, UI_CARD);
    drawLinkBars(136, 48, lastHostRssi, isHostOnline);
    String sub = isHostOnline ? ("CH " + String(espnowChannel) + "   " + String(lastHostRssi) + " dBm")
                              : ("SEARCHING CH " + String(espnowChannel));
    textAt(padTo(sub, 22), 14, 72, 1, UI_DIM, UI_CARD);
  }

  bool doActive = dropLineActive();
  String sensorKey = String(doActive ? 1 : 0) + ":" + String(dropIsrCount) + ":" + String((int)currentGttMin);
  if (sensorKey != cacheP3b) {
    cacheP3b = sensorKey;
    textAt(padTo(doActive ? "DO HIGH" : "DO LOW", 10), 14, 118, 2,
           doActive ? COLOR_YELLOW : COLOR_WHITE, UI_CARD);
    textAt(padTo("PULSE " + String(dropIsrCount) + "   " + String(currentGttMin, 1) + " gtt/m", 22),
           14, 144, 1, UI_DIM, UI_CARD);
    textAt(padTo(sensorLineStuck ? "CHECK SENSOR WIRING"
                                 : ("DIGITAL  GPIO " + String(DROP_DO_PIN)), 22),
           14, 160, 1, sensorLineStuck ? COLOR_RED : UI_DIM, UI_CARD);
  }

  float bv = readStationBattery();
  String devKey = String(currentStationId) + ":" + String(safeDropFactor(dropFactor)) + ":" + String((int)(bv * 10)) + ":" + String(totalDrops);
  if (devKey != cacheP3c) {
    cacheP3c = devKey;
    char bed[12];
    snprintf(bed, sizeof(bed), "BED %02d", currentStationId);
    textAt(padTo(String(bed) + "  DF" + String(safeDropFactor(dropFactor)), 12), 14, 212, 2, COLOR_WHITE, UI_CARD);
    textAt(padTo("DROPS " + String(totalDrops), 22), 14, 236, 1, UI_DIM, UI_CARD);
    String pw = (bv > 0.5f) ? ("BATT " + String(bv, 2) + " V") : String("POWER USB");
    textAt(padTo("FW " APP_VERSION "   " + pw, 22), 14, 252, 1, UI_DIM, UI_CARD);
  }
}

// ============================================================================
// หน้า 4: TREND — กราฟแท่งอัตราไหลย้อนหลัง 30 นาที (แท่งละ 1 นาที)
// ============================================================================
#define CHART_X    12
#define CHART_BARW 5
#define CHART_TOP  56
#define CHART_BOT  196

