kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_6_0/ESP32-S3-Station-V_7_6_0.ino
  lastEmergencyCode = code;
  cacheRate = -9999;
  stateNeedsRedraw = false;
}

void updateEmergencyDynamic() {
  int rate = (int)(currentFlowRate_ml_hr + 0.5f);
  if (rate == cacheRate) return;
  cacheRate = rate;
  tft.fillRect(20, 140, 132, 40, THEME_BG);
  textAt(String(rate), 22, 142, 5, COLOR_WHITE, THEME_BG);
}

// ============================================================================
// จอเตือนใกล้หมดถุง (สีส้ม ไม่ใช่เหตุวิกฤต)
// ============================================================================
void drawNearEndNoticeFramework() {
  tft.fillScreen(COLOR_ORANGE);
  tft.fillRoundRect(12, 12, 148, 32, 6, COLOR_WHITE);
  char bed[12];
  snprintf(bed, sizeof(bed), "BED %02d", currentStationId);
  drawCenteredString(String(bed), 20, 2, COLOR_ORANGE, COLOR_WHITE);

  drawCenteredString("NEXT BAG", 60, 3, THEME_BG, COLOR_ORANGE);
  drawCenteredString("PREPARE NEW IV BAG", 94, 1, THEME_BG, COLOR_ORANGE);

  tft.fillRoundRect(12, 114, 148, 104, 8, THEME_BG);
  tft.fillRoundRect(14, 236, 144, 58, 8, COLOR_WHITE);
  drawCenteredString("CLICK = OK", 248, 2, COLOR_ORANGE, COLOR_WHITE);
  drawCenteredString("(stop reminder)", 274, 1, THEME_BG, COLOR_WHITE);

  cacheNear = "";
  stateNeedsRedraw = false;
}

void updateNearEndNoticeDynamic() {
  int pct = infusedPct();
  int left = remainingMlInt();
  String end = endClockText();
  String key = String(pct) + ":" + String(left) + ":" + end;
  if (key == cacheNear) return;
  cacheNear = key;

  textCenterIn(padTo("INFUSED " + String(pct < 0 ? 0 : pct) + "%", 12), 12, 148, 126, 2, COLOR_WHITE, THEME_BG);
  textCenterIn(padTo(String(left) + " mL LEFT", 12), 12, 148, 152, 2, COLOR_ORANGE, THEME_BG);
  textCenterIn(padTo("EMPTY AT " + end, 18), 12, 148, 180, 1, COLOR_YELLOW, THEME_BG);
  drawProgressBar(26, 196, 120, 10, (pct < 0) ? 0 : pct, COLOR_ORANGE);
}

// ============================================================================
// Screensaver — เห็นเฉพาะสิ่งที่ต้องดูจากระยะไกล
// ============================================================================
void drawScreensaverFramework() {
  tft.fillScreen(THEME_BG);
  UiStatus st = uiStatusOf(uiAlertCode);
  char bed[12];
  snprintf(bed, sizeof(bed), "BED %02d", currentStationId);
  tft.fillRoundRect(46, 20, 80, 28, 6, uiStatusColor(st));
  textCenterIn(String(bed), 46, 80, 26, 2, THEME_BG, uiStatusColor(st));
  drawCenteredString("mL/h", 232, 1, UI_DIM, THEME_BG);
  drawCenteredString("CLICK TO WAKE", 296, 1, UI_DIM, THEME_BG);
  cacheClock = ""; cacheRate = -9999; cacheStatusWord = "";
  stateNeedsRedraw = false;
}

void updateScreensaverDynamic() {
  String clockStr = getStationClockStr();
  if (clockStr != cacheClock) {
    cacheClock = clockStr;
    drawCenteredString(clockStr, 76, 5, COLOR_WHITE, THEME_BG);
  }

  UiStatus st = uiStatusOf(uiAlertCode);
  String word = String(uiStatusWord(st));
  if (word != cacheStatusWord) {
    cacheStatusWord = word;
    tft.fillRect(6, 136, 160, 20, THEME_BG);
    drawCenteredString(word, 138, 2, uiStatusColor(st), THEME_BG);
  }

  int rate = isRunning ? (int)(currentFlowRate_ml_hr + 0.5f) : -1;
  if (rate != cacheRate) {
    cacheRate = rate;
    tft.fillRect(6, 180, 160, 44, THEME_BG);
    drawCenteredString(rate >= 0 ? String(rate) : String("--"), 182, 5,
                       (st == UI_NOFLOW) ? COLOR_RED : COLOR_WHITE, THEME_BG);
  }
}

// ============================================================================
// หน้าผู้พัฒนา / หน้าตั้งหมายเลขเตียง
// ============================================================================
void drawDeveloperCreditScreen() {
  tft.fillScreen(THEME_BG);
  tft.fillRoundRect(6, 16, 160, 34, 6, THEME_PINK);
  drawCenteredString("SMART IV ALERT", 26, 2, THEME_BG, THEME_PINK);

  drawCenteredString("Bed Station Node", 66, 1, UI_DIM, THEME_BG);
  drawCenteredString("FW v" APP_VERSION, 82, 1, THEME_SKYBLUE, THEME_BG);

  tft.fillRoundRect(6, 106, 160, 96, 8, UI_CARD);
  drawCenteredString("DEVELOPER", 114, 1, UI_DIM, UI_CARD);
  drawCenteredString("Kittiphan", 132, 2, COLOR_YELLOW, UI_CARD);
  drawCenteredString("Rattanakorn", 154, 2, COLOR_YELLOW, UI_CARD);
  drawCenteredString("MCU Phrae Campus", 180, 1, UI_DIM, UI_CARD);

  tft.fillRoundRect(6, 212, 160, 60, 8, UI_CARD);
  drawCenteredString("BCN Phrae Innovation", 224, 1, THEME_CYAN, UI_CARD);
  drawCenteredString("Suk Mean Hospital Trial", 244, 1, UI_DIM, UI_CARD);

  drawCenteredString("CLICK TO RETURN", 296, 1, UI_DIM, THEME_BG);
  stateNeedsRedraw = false;
}

void drawStationIdConfigFramework() {
  tft.fillScreen(THEME_BG);
  tft.fillRoundRect(6, 16, 160, 34, 6, THEME_SKYBLUE);
  drawCenteredString("SET BED ID", 26, 2, THEME_BG, THEME_SKYBLUE);
  tft.fillRoundRect(6, 62, 160, 150, 8, UI_CARD);
  drawCenteredString("CLICK = NEXT (1-8)", 224, 1, UI_DIM, THEME_BG);
  cacheConfig = "";
  stateNeedsRedraw = false;
}

void updateStationIdConfigDynamic() {
  long msLeft = (long)configAutoSaveTimeout - (long)millis();
  int leftSec = (msLeft > 0) ? (int)(msLeft / 1000) + 1 : 0;
  String key = String(tempConfigStationId) + ":" + String(leftSec);
  if (key == cacheConfig) return;
  cacheConfig = key;

  tft.fillRect(40, 84, 92, 108, UI_CARD);
  drawCenteredString(String(tempConfigStationId), 90, 12, THEME_SKYBLUE, UI_CARD);
  drawCenteredString(padTo("SAVING IN " + String(leftSec) + "s", 16), 250, 1, COLOR_YELLOW, THEME_BG);
}

// ----------------------------------------------------------------------------
// ปุ่มกด
// ----------------------------------------------------------------------------
void handleButton() {
  static unsigned long btnPressStart = 0;
  static bool isHolding = false;
  static int clickCount = 0;
  static unsigned long lastReleaseTime = 0;

  bool reading = (digitalRead(BTN_PIN) == LOW);
  unsigned long now = millis();

  if (reading && !isHolding) {
    btnPressStart = now;
    isHolding = true;
    isHoldUiActive = false;
    holdBeep3sDone = false;
    holdBeep5sDone = false;
    lastUserActivityTime = now;
  }
  else if (reading && isHolding) {
    unsigned long holdDur = now - btnPressStart;
    if (holdDur >= 400 && currentState != STATE_CONFIG_ID) {
      isHoldUiActive = true;
      if (holdDur >= 3000 && !holdBeep3sDone) {
        beepNonBlocking(2200, 50);
        holdBeep3sDone = true;
      }
      if (holdDur >= 5000 && !holdBeep5sDone) {
        beepNonBlocking(2600, 80);
        holdBeep5sDone = true;
      }
      if (now - lastHoldRenderTime >= 35) {
        lastHoldRenderTime = now;
        drawHoldProgressHUD(holdDur);
      }
    }
  }
  else if (!reading && isHolding) {
    unsigned long pressDur = now - btnPressStart;
    isHolding = false;
    lastUserActivityTime = now;

